#include <stdio.h>

/**
 * 指针: 地址就是指针
 *  1.32系统下指针大小为4字节，64位系统下指针大小为8字节
 *  2.指向int类型数据的指针就是int类型指针,指向char类型数据的指针就是char类型指针
 */

int main()
{
    // 变量的声明
    int a = 10, b = 20;
    printf("a = %d, b = %d, &a = %p, &b = %p\n", a, b, &a, &b);
    int nums[] = { 1,2,3 };
    printf("---------------------------------------------\n");

    // 通过打印结果可以看出: 1.数组在内存中是连续存储的 2.一个int类型数据在内存中占据四个字节
    int len = sizeof(nums) / sizeof(nums[0]);
    for(int i=0; i<len; i++)
    {
    	printf("nums[%d] = %d, &nums[%d] = %p\n", i, nums[i], i, &nums[i]);
    }
    printf("---------------------------------------------\n");

    // 指针变量的声明，一般初始时声明为空指针
    int* p = NULL;
    // 在指针变量中存储变量a的地址
    p = &a;
    // 注意: 1.指针p本身也会有一个物理内存地址 2.32位系统中指针占据4个字节，64位系统中指针占据8个字节
    printf("a的内存地址 = %p, 指针变量p中存储的(变量a)内存地址 = %p, 指针p的地址&p = %p\n", &a, p, &p);
    printf("指针大小:%d\n", sizeof(p));
    // *p代表的是a本身,把100赋值给*p,就意味把100赋值给a,*这个符号代表对一个指针类型数据解引用
    *p = 100;
    printf("a = %d, *p代表的变量的值(a的值) = %d\n", a, *p);
    p = &b;
    // 此时*p代表的是b本身,把100赋值给*p,就意味把100赋值给b
    *p = 200;
    printf("b = %d, *p代表的变量的值(b的值) = %d\n", b, *p);
    printf("---------------------------------------------\n");

    /**
     * 物理内存与寄存器
     */
    int num = 10;
    // 打印数字 10
    printf("%d\n", num);
    // 打印数字10的内存地址
    printf("%p\n", &num);
    // 为什么&num可以，&10就会报错，因为&代表取内存地址，num存放于内存中，而10存放在寄存器中
    //printf("%p\n", &10);
    printf("---------------------------------------------\n");

    /**
     * 在一行代码中定义两个指针变量
     */
    int c = 100, d = 200;
    // 一次性定义两个指针变量: 正确写法
    int* p1, * p2;
    // 一次性定义两个指针变量: 错误写法,这种写法p2不是指针类型变量,是int类型变量
    //int* p1,p2;
    p1 = &c;
    p2 = &d;
    printf("p1的物理地址 = %p\n", p1);
    printf("p2的物理地址 = %p\n", p2);
    printf("---------------------------------------------\n");

    /**
     * C语言中的NULL指针
     */
    int* pNULL = NULL;
    printf("pNULL的内存地址 = %p\n", pNULL);
    printf("---------------------------------------------\n");

    //C语言字符串和指针
    char stra[] = { "hello" };
    char strb[] = { "hello" };

    char* spa = "hello";
    char* spb = "hello";

    char* spc = { "hello" };
    char* spd = { "hello" };

    printf("%d \n", (stra == strb));
    printf("%d \n", (spa == spb));
    printf("%d \n", (spc == spd));
    printf("---------------------------------------------\n");

    // 数据的小端存储:高位数存放在高地址,低位数存放在低地址,变量的首地址就是变量的低地址
    // j的值 从右往左: 低位数->高位数(这是16进制,可以像理解10进制数据一样来理解,从右往左依次是 个位->十位->百位->千位,位数是从低到高)
    // 地址的值 从右往左: 高地址->低地址(因为地址是二进制数据,只是在显示时将4个二进制数据合并为一个16进制数据)
    int j = 0x12345678;
    int* pj = &j;
    printf("j的物理地址 = %p\n", pj);
}
